; domain
;; Gold Miner domain

(define (domain gold-miner-typed)
(:requirements :typing)
(:types LOC)

(:predicates
        (robot-at ?x - LOC)
        (bomb-at ?x - LOC )
        (laser-at ?x - LOC)
        (soft-rock-at ?x - LOC)
        (hard-rock-at ?x - LOC)
        (gold-at ?x - LOC)
        (arm-empty)
        (holds-bomb)
                (holds-laser)
        (holds-gold)
        (clear ?x - LOC)
        (connected ?x - LOC ?y - LOC)
)


; move to an adjacent empty grid location
(:action move
  :parameters (?x - LOC ?y - LOC)
  :precondition (and (robot-at ?x) (connected ?x ?y) (clear ?y))
  :effect (and (robot-at ?y) (not (robot-at ?x)))
)

(:action pickup-laser
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (laser-at ?x) (arm-empty))
  :effect (and (not (arm-empty)) (holds-laser) (not (laser-at ?x)) )
)

;have to be over the bomb location to pick the bomb
(:action pickup-bomb
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (bomb-at ?x) (arm-empty))
  :effect (and (not (arm-empty)) (holds-bomb))
)

(:action putdown-laser
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (holds-laser))
  :effect (and (arm-empty) (not (holds-laser)) (laser-at ?x))
)

;bomb an adjacent location that has soft-rock
(:action detonate-bomb
  :parameters (?x - LOC ?y - LOC)
  :precondition (and (robot-at ?x) (holds-bomb)
                     (connected ?x ?y) (soft-rock-at ?y))
  :effect (and (not (holds-bomb)) (arm-empty) (clear ?y) (not (soft-rock-at ?y)))
)

(:action fire-laser
  :parameters (?x - LOC ?y - LOC)
  :precondition (and (robot-at ?x) (holds-laser)
                     (connected ?x ?y))
  :effect (and (clear ?y) (not (soft-rock-at ?y)) (not (gold-at ?y))
               (not (hard-rock-at ?y)))
)

;mine gold !
;the robot has to be over the gold location to pick it up
(:action pick-gold
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (arm-empty) (gold-at ?x))
  :effect (and (not (arm-empty)) (holds-gold))
)
)

; problem
(define (problem typed-bomberman-rows8-cols8-neargoal-d17)
(:domain gold-miner-typed)
(:objects f0-0f f0-1f f0-2f f0-3f f0-4f f0-5f f0-6f f0-7f f1-0f f1-1f f1-2f f1-3f f1-4f f1-5f f1-6f f1-7f f2-0f f2-1f f2-2f f2-3f f2-4f f2-5f f2-6f f2-7f f3-0f f3-1f f3-2f f3-3f f3-4f f3-5f f3-6f f3-7f f4-0f f4-1f f4-2f f4-3f f4-4f f4-5f f4-6f f4-7f f5-0f f5-1f f5-2f f5-3f f5-4f f5-5f f5-6f f5-7f f6-0f f6-1f f6-2f f6-3f f6-4f f6-5f f6-6f f6-7f f7-0f f7-1f f7-2f f7-3f f7-4f f7-5f f7-6f f7-7f - LOC)
(:init
(bomb-at f1-0f)
(clear f0-0f)
(clear f0-1f)
(clear f1-0f)
(clear f1-1f)
(clear f1-2f)
(clear f2-0f)
(clear f2-2f)
(clear f2-7f)
(clear f3-0f)
(clear f3-7f)
(clear f4-0f)
(clear f4-7f)
(clear f5-0f)
(clear f5-1f)
(clear f5-5f)
(clear f5-6f)
(clear f5-7f)
(clear f6-0f)
(clear f6-1f)
(clear f6-2f)
(clear f6-3f)
(clear f6-4f)
(clear f6-5f)
(clear f7-0f)
(clear f7-3f)
(clear f7-4f)
(clear f7-5f)
(connected f0-0f f0-1f)
(connected f0-0f f1-0f)
(connected f0-1f f0-0f)
(connected f0-1f f0-2f)
(connected f0-1f f1-1f)
(connected f0-2f f0-1f)
(connected f0-2f f0-3f)
(connected f0-2f f1-2f)
(connected f0-3f f0-2f)
(connected f0-3f f0-4f)
(connected f0-3f f1-3f)
(connected f0-4f f0-3f)
(connected f0-4f f0-5f)
(connected f0-4f f1-4f)
(connected f0-5f f0-4f)
(connected f0-5f f0-6f)
(connected f0-5f f1-5f)
(connected f0-6f f0-5f)
(connected f0-6f f0-7f)
(connected f0-6f f1-6f)
(connected f0-7f f0-6f)
(connected f0-7f f1-7f)
(connected f1-0f f0-0f)
(connected f1-0f f1-1f)
(connected f1-0f f2-0f)
(connected f1-1f f0-1f)
(connected f1-1f f1-0f)
(connected f1-1f f1-2f)
(connected f1-1f f2-1f)
(connected f1-2f f0-2f)
(connected f1-2f f1-1f)
(connected f1-2f f1-3f)
(connected f1-2f f2-2f)
(connected f1-3f f0-3f)
(connected f1-3f f1-2f)
(connected f1-3f f1-4f)
(connected f1-3f f2-3f)
(connected f1-4f f0-4f)
(connected f1-4f f1-3f)
(connected f1-4f f1-5f)
(connected f1-4f f2-4f)
(connected f1-5f f0-5f)
(connected f1-5f f1-4f)
(connected f1-5f f1-6f)
(connected f1-5f f2-5f)
(connected f1-6f f0-6f)
(connected f1-6f f1-5f)
(connected f1-6f f1-7f)
(connected f1-6f f2-6f)
(connected f1-7f f0-7f)
(connected f1-7f f1-6f)
(connected f1-7f f2-7f)
(connected f2-0f f1-0f)
(connected f2-0f f2-1f)
(connected f2-0f f3-0f)
(connected f2-1f f1-1f)
(connected f2-1f f2-0f)
(connected f2-1f f2-2f)
(connected f2-1f f3-1f)
(connected f2-2f f1-2f)
(connected f2-2f f2-1f)
(connected f2-2f f2-3f)
(connected f2-2f f3-2f)
(connected f2-3f f1-3f)
(connected f2-3f f2-2f)
(connected f2-3f f2-4f)
(connected f2-3f f3-3f)
(connected f2-4f f1-4f)
(connected f2-4f f2-3f)
(connected f2-4f f2-5f)
(connected f2-4f f3-4f)
(connected f2-5f f1-5f)
(connected f2-5f f2-4f)
(connected f2-5f f2-6f)
(connected f2-5f f3-5f)
(connected f2-6f f1-6f)
(connected f2-6f f2-5f)
(connected f2-6f f2-7f)
(connected f2-6f f3-6f)
(connected f2-7f f1-7f)
(connected f2-7f f2-6f)
(connected f2-7f f3-7f)
(connected f3-0f f2-0f)
(connected f3-0f f3-1f)
(connected f3-0f f4-0f)
(connected f3-1f f2-1f)
(connected f3-1f f3-0f)
(connected f3-1f f3-2f)
(connected f3-1f f4-1f)
(connected f3-2f f2-2f)
(connected f3-2f f3-1f)
(connected f3-2f f3-3f)
(connected f3-2f f4-2f)
(connected f3-3f f2-3f)
(connected f3-3f f3-2f)
(connected f3-3f f3-4f)
(connected f3-3f f4-3f)
(connected f3-4f f2-4f)
(connected f3-4f f3-3f)
(connected f3-4f f3-5f)
(connected f3-4f f4-4f)
(connected f3-5f f2-5f)
(connected f3-5f f3-4f)
(connected f3-5f f3-6f)
(connected f3-5f f4-5f)
(connected f3-6f f2-6f)
(connected f3-6f f3-5f)
(connected f3-6f f3-7f)
(connected f3-6f f4-6f)
(connected f3-7f f2-7f)
(connected f3-7f f3-6f)
(connected f3-7f f4-7f)
(connected f4-0f f3-0f)
(connected f4-0f f4-1f)
(connected f4-0f f5-0f)
(connected f4-1f f3-1f)
(connected f4-1f f4-0f)
(connected f4-1f f4-2f)
(connected f4-1f f5-1f)
(connected f4-2f f3-2f)
(connected f4-2f f4-1f)
(connected f4-2f f4-3f)
(connected f4-2f f5-2f)
(connected f4-3f f3-3f)
(connected f4-3f f4-2f)
(connected f4-3f f4-4f)
(connected f4-3f f5-3f)
(connected f4-4f f3-4f)
(connected f4-4f f4-3f)
(connected f4-4f f4-5f)
(connected f4-4f f5-4f)
(connected f4-5f f3-5f)
(connected f4-5f f4-4f)
(connected f4-5f f4-6f)
(connected f4-5f f5-5f)
(connected f4-6f f3-6f)
(connected f4-6f f4-5f)
(connected f4-6f f4-7f)
(connected f4-6f f5-6f)
(connected f4-7f f3-7f)
(connected f4-7f f4-6f)
(connected f4-7f f5-7f)
(connected f5-0f f4-0f)
(connected f5-0f f5-1f)
(connected f5-0f f6-0f)
(connected f5-1f f4-1f)
(connected f5-1f f5-0f)
(connected f5-1f f5-2f)
(connected f5-1f f6-1f)
(connected f5-2f f4-2f)
(connected f5-2f f5-1f)
(connected f5-2f f5-3f)
(connected f5-2f f6-2f)
(connected f5-3f f4-3f)
(connected f5-3f f5-2f)
(connected f5-3f f5-4f)
(connected f5-3f f6-3f)
(connected f5-4f f4-4f)
(connected f5-4f f5-3f)
(connected f5-4f f5-5f)
(connected f5-4f f6-4f)
(connected f5-5f f4-5f)
(connected f5-5f f5-4f)
(connected f5-5f f5-6f)
(connected f5-5f f6-5f)
(connected f5-6f f4-6f)
(connected f5-6f f5-5f)
(connected f5-6f f5-7f)
(connected f5-6f f6-6f)
(connected f5-7f f4-7f)
(connected f5-7f f5-6f)
(connected f5-7f f6-7f)
(connected f6-0f f5-0f)
(connected f6-0f f6-1f)
(connected f6-0f f7-0f)
(connected f6-1f f5-1f)
(connected f6-1f f6-0f)
(connected f6-1f f6-2f)
(connected f6-1f f7-1f)
(connected f6-2f f5-2f)
(connected f6-2f f6-1f)
(connected f6-2f f6-3f)
(connected f6-2f f7-2f)
(connected f6-3f f5-3f)
(connected f6-3f f6-2f)
(connected f6-3f f6-4f)
(connected f6-3f f7-3f)
(connected f6-4f f5-4f)
(connected f6-4f f6-3f)
(connected f6-4f f6-5f)
(connected f6-4f f7-4f)
(connected f6-5f f5-5f)
(connected f6-5f f6-4f)
(connected f6-5f f6-6f)
(connected f6-5f f7-5f)
(connected f6-6f f5-6f)
(connected f6-6f f6-5f)
(connected f6-6f f6-7f)
(connected f6-6f f7-6f)
(connected f6-7f f5-7f)
(connected f6-7f f6-6f)
(connected f6-7f f7-7f)
(connected f7-0f f6-0f)
(connected f7-0f f7-1f)
(connected f7-1f f6-1f)
(connected f7-1f f7-0f)
(connected f7-1f f7-2f)
(connected f7-2f f6-2f)
(connected f7-2f f7-1f)
(connected f7-2f f7-3f)
(connected f7-3f f6-3f)
(connected f7-3f f7-2f)
(connected f7-3f f7-4f)
(connected f7-4f f6-4f)
(connected f7-4f f7-3f)
(connected f7-4f f7-5f)
(connected f7-5f f6-5f)
(connected f7-5f f7-4f)
(connected f7-5f f7-6f)
(connected f7-6f f6-6f)
(connected f7-6f f7-5f)
(connected f7-6f f7-7f)
(connected f7-7f f6-7f)
(connected f7-7f f7-6f)
(gold-at f1-7f)
(hard-rock-at f0-2f)
(hard-rock-at f0-3f)
(hard-rock-at f0-5f)
(hard-rock-at f0-6f)
(hard-rock-at f0-7f)
(hard-rock-at f1-3f)
(hard-rock-at f1-4f)
(hard-rock-at f1-5f)
(hard-rock-at f2-1f)
(hard-rock-at f2-3f)
(hard-rock-at f2-4f)
(hard-rock-at f3-1f)
(hard-rock-at f3-2f)
(hard-rock-at f3-3f)
(hard-rock-at f3-4f)
(hard-rock-at f3-5f)
(hard-rock-at f3-6f)
(hard-rock-at f4-1f)
(hard-rock-at f4-2f)
(hard-rock-at f4-4f)
(hard-rock-at f4-6f)
(hard-rock-at f5-2f)
(hard-rock-at f5-3f)
(hard-rock-at f5-4f)
(hard-rock-at f6-6f)
(hard-rock-at f6-7f)
(hard-rock-at f7-1f)
(hard-rock-at f7-2f)
(hard-rock-at f7-7f)
(holds-bomb)
(laser-at f1-0f)
(robot-at f3-0f)
(soft-rock-at f0-4f)
(soft-rock-at f1-6f)
(soft-rock-at f1-7f)
(soft-rock-at f2-5f)
(soft-rock-at f2-6f)
(soft-rock-at f4-3f)
(soft-rock-at f4-5f)
(soft-rock-at f7-6f)
)
(:goal (and
(holds-gold)
))
)

; plan
1. (move f3-0f f4-0f)
   deleted: (robot-at f3-0f)
   added: (robot-at f4-0f)
   goals met: 0 of 1
2. (move f4-0f f5-0f)
   deleted: (robot-at f4-0f)
   added: (robot-at f5-0f)
   goals met: 0 of 1
3. (move f5-0f f6-0f)
   deleted: (robot-at f5-0f)
   added: (robot-at f6-0f)
   goals met: 0 of 1
4. (move f6-0f f6-1f)
   deleted: (robot-at f6-0f)
   added: (robot-at f6-1f)
   goals met: 0 of 1
5. (move f6-1f f6-2f)
   deleted: (robot-at f6-1f)
   added: (robot-at f6-2f)
   goals met: 0 of 1
6. (move f6-2f f6-3f)
   deleted: (robot-at f6-2f)
   added: (robot-at f6-3f)
   goals met: 0 of 1
7. (move f6-3f f6-4f)
   deleted: (robot-at f6-3f)
   added: (robot-at f6-4f)
   goals met: 0 of 1
8. (move f6-4f f6-5f)
   deleted: (robot-at f6-4f)
   added: (robot-at f6-5f)
   goals met: 0 of 1
9. (move f6-5f f5-5f)
   deleted: (robot-at f6-5f)
   added: (robot-at f5-5f)
   goals met: 0 of 1
10. (move f5-5f f5-6f)
   deleted: (robot-at f5-5f)
   added: (robot-at f5-6f)
   goals met: 0 of 1
11. (move f5-6f f5-7f)
   deleted: (robot-at f5-6f)
   added: (robot-at f5-7f)
   goals met: 0 of 1
12. (move f5-7f f4-7f)
   deleted: (robot-at f5-7f)
   added: (robot-at f4-7f)
   goals met: 0 of 1
13. (move f4-7f f3-7f)
   deleted: (robot-at f4-7f)
   added: (robot-at f3-7f)
   goals met: 0 of 1
14. (move f3-7f f2-7f)
   deleted: (robot-at f3-7f)
   added: (robot-at f2-7f)
   goals met: 0 of 1
15. (detonate-bomb f2-7f f1-7f)
   deleted: (holds-bomb) (soft-rock-at f1-7f)
   added: (arm-empty) (clear f1-7f)
   goals met: 0 of 1
16. (move f2-7f f1-7f)
   deleted: (robot-at f2-7f)
   added: (robot-at f1-7f)
   goals met: 0 of 1
17. (pick-gold f1-7f)
   deleted: (arm-empty)
   added: (holds-gold)
   goals met: 1 of 1
